Input file: pc_dwarf_aircrack_ng.macho



*** Compilation Units: .debug_info ***

Header length  : 0x0000000000002D2F
Version        : 2
Abbrev. offset : 0x0000000000000000
Address size   : 4
Offset size    : 4
Extension size : 0
Next header    : 0x0000000000002D33

DW_TAG_compile_unit       <11 (CU 0@0+11)>
DW_AT_producer       (25;strp) 4.2.1 (Based on Apple Inc. build 5658) (LLVM build 2336.1.00)
DW_AT_language       (13;dat1) DW_LANG_C89
DW_AT_name           (03;strp) aircrack-ng.c
DW_AT_entry_pc       (52;addr) 0x00001c60
DW_AT_stmt_list      (10;dat4) 0x00000000
DW_AT_comp_dir       (1B;strp) /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/
DW_AT_APPLE_optimized (3FE1;flag) yes(1)
  
  DW_TAG_subprogram         <34 (CU 0@0+34)>
  DW_AT_name           (03;strp) show_result
  DW_AT_MIPS_linkage_name (2007;strp) show_result
  DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
  DW_AT_decl_line      (3B;dat1) 21
  DW_AT_prototyped     (27;flag) yes(1)
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_low_pc         (11;addr) 0x00001c60
  DW_AT_high_pc        (12;addr) 0x00001cba
  DW_AT_frame_base     (40;blk1) (DW_OP_reg5)
    
    DW_TAG_formal_parameter   <61 (CU 0@0+61)>
    DW_AT_name           (03;strp) key
    DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
    DW_AT_decl_line      (3B;dat1) 20

      DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
      DW_AT_decl_line      (3B;dat1) 60
      DW_AT_type           (49;ref4) <10848 (CU 0@0+10848)>
      DW_AT_const_value    (1C;blk1) 00
      DW_AT_start_scope    (2C;addr) 0x0000b07a
      
      DW_TAG_variable           <7681 (CU 0@0+7681)>
      DW_AT_name           (03;strn) v4
      DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
      DW_AT_decl_line      (3B;dat1) 60
      DW_AT_type           (49;ref4) <11549 (CU 0@0+11549)>
      DW_AT_location       (02;blk1) (DW_OP_reg2)
      DW_AT_start_scope    (2C;addr) 0x0000b6c2
      
      DW_TAG_variable           <7697 (CU 0@0+7697)>
      DW_AT_name           (03;strn) u3
      DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
      DW_AT_decl_line      (3B;dat1) 60
      DW_AT_type           (49;ref4) <11549 (CU 0@0+11549)>
      DW_AT_location       (02;blk1) (DW_OP_reg1)
      DW_AT_start_scope    (2C;addr) 0x0000b6c2
      
      DW_TAG_variable           <7713 (CU 0@0+7713)>
      DW_AT_name           (03;strn) v
      DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
      DW_AT_decl_line      (3B;dat1) 60
      DW_AT_type           (49;ref4) <11549 (CU 0@0+11549)>
      DW_AT_location       (02;blk1) (DW_OP_reg2)
      DW_AT_start_scope    (2C;addr) 0x0000b6c2
      
      DW_TAG_variable           <7728 (CU 0@0+7728)>
      DW_AT_name           (03;strn) u
      DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
      DW_AT_decl_line      (3B;dat1) 60
      DW_AT_type           (49;ref4) <11549 (CU 0@0+11549)>
      DW_AT_location       (02;blk1) (DW_OP_reg1)
      DW_AT_start_scope    (2C;addr) 0x0000b6c2
      
      DW_TAG_variable           <7743 (CU 0@0+7743)>
      DW_AT_name           (03;strp) pmks
      DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
      DW_AT_decl_line      (3B;dat1) 50
      DW_AT_type           (49;ref4) <11557 (CU 0@0+11557)>
      
      DW_TAG_variable           <7754 (CU 0@0+7754)>
      DW_AT_name           (03;strp) k_ipad
      DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
      DW_AT_decl_line      (3B;dat1) 53
      DW_AT_type           (49;ref4) <7995 (CU 0@0+7995)>
      
      DW_TAG_variable           <7765 (CU 0@0+7765)>
      DW_AT_name           (03;strp) k_opad
      DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
      DW_AT_decl_line      (3B;dat1) 55
      DW_AT_type           (49;ref4) <7995 (CU 0@0+7995)>
      
      DW_TAG_variable           <7776 (CU 0@0+7776)>
      DW_AT_name           (03;strp) buffer
      DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
      DW_AT_decl_line      (3B;dat1) 57
      DW_AT_type           (49;ref4) <7995 (CU 0@0+7995)>
      
      DW_TAG_variable           <7787 (CU 0@0+7787)>
      DW_AT_name           (03;strp) pmk1
      DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
      DW_AT_decl_line      (3B;dat1) 61
      DW_AT_type           (49;ref4) <8445 (CU 0@0+8445)>
      
      DW_TAG_variable           <7798 (CU 0@0+7798)>
      DW_AT_name           (03;strp) pmk2
      DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
      DW_AT_decl_line      (3B;dat1) 61
      DW_AT_type           (49;ref4) <8445 (CU 0@0+8445)>
      
      DW_TAG_variable           <7809 (CU 0@0+7809)>
      DW_AT_name           (03;strp) pmk3
      DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
      DW_AT_decl_line      (3B;dat1) 61
      DW_AT_type           (49;ref4) <8445 (CU 0@0+8445)>
      
      DW_TAG_variable           <7820 (CU 0@0+7820)>
      DW_AT_name           (03;strp) pmk4
      DW_AT_decl_file      (3A;dat1) 0x00000002 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h
      DW_AT_decl_line      (3B;dat1) 61
      DW_AT_type           (49;ref4) <8445 (CU 0@0+8445)>
  
  DW_TAG_base_type          <7833 (CU 0@0+7833)>
  DW_AT_encoding       (3E;dat1) DW_ATE_unsigned
  DW_AT_name           (03;strp) short unsigned int
  DW_AT_byte_size      (0B;dat1) 0x00000002
  
  DW_TAG_base_type          <7840 (CU 0@0+7840)>
  DW_AT_encoding       (3E;dat1) DW_ATE_signed
  DW_AT_name           (03;strp) long int
  DW_AT_byte_size      (0B;dat1) 0x00000004
  
  DW_TAG_base_type          <7847 (CU 0@0+7847)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_encoding       (3E;dat1) DW_ATE_signed
  
  DW_TAG_array_type         <7850 (CU 0@0+7850)>
  DW_AT_type           (49;ref4) <6919 (CU 0@0+6919)>
    
    DW_TAG_subrange_type      <7859 (CU 0@0+7859)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 39
  
  DW_TAG_structure_type     <7866 (CU 0@0+7866)>
  DW_AT_name           (03;strp) _opaque_pthread_mutex_t
  DW_AT_byte_size      (0B;dat1) 0x0000002c
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 67
    
    DW_TAG_member             <7878 (CU 0@0+7878)>
    DW_AT_name           (03;strp) __sig
    DW_AT_type           (49;ref4) <7840 (CU 0@0+7840)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 67
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <7892 (CU 0@0+7892)>
    DW_AT_name           (03;strp) __opaque
    DW_AT_type           (49;ref4) <7850 (CU 0@0+7850)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 67
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
  
  DW_TAG_typedef            <7907 (CU 0@0+7907)>
  DW_AT_type           (49;ref4) <7866 (CU 0@0+7866)>
  DW_AT_name           (03;strp) pthread_mutex_t
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat2) 334
  
  DW_TAG_variable           <7919 (CU 0@0+7919)>
  DW_AT_name           (03;strp) mx_wpastats
  DW_AT_type           (49;ref4) <7907 (CU 0@0+7907)>
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 115
  DW_AT_location       (02;blk1) (DW_OP_addr 0x00019000)
  
  DW_TAG_variable           <7936 (CU 0@0+7936)>
  DW_AT_name           (03;strp) wepkey_crack_success
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 108
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001a560)
  
  DW_TAG_array_type         <7954 (CU 0@0+7954)>
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    
    DW_TAG_subrange_type      <7963 (CU 0@0+7963)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 28
  
  DW_TAG_variable           <7970 (CU 0@0+7970)>
  DW_AT_name           (03;strp) PTW_DEFAULTBF
  DW_AT_type           (49;ref4) <7954 (CU 0@0+7954)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 154
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001a580)
  
  DW_TAG_base_type          <7988 (CU 0@0+7988)>
  DW_AT_encoding       (3E;dat1) DW_ATE_unsigned_char
  DW_AT_name           (03;strp) unsigned char
  DW_AT_byte_size      (0B;dat1) 0x00000001
  
  DW_TAG_array_type         <7995 (CU 0@0+7995)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <8004 (CU 0@0+8004)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat2) 255
  
  DW_TAG_variable           <8012 (CU 0@0+8012)>
  DW_AT_name           (03;strn) R
  DW_AT_type           (49;ref4) <7995 (CU 0@0+7995)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 156
  DW_AT_location       (02;blk1) (DW_OP_addr 0x00015e00)
  
  DW_TAG_variable           <8028 (CU 0@0+8028)>
  DW_AT_name           (03;strp) close_aircrack
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 109
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001a5f4)
  
  DW_TAG_array_type         <8046 (CU 0@0+8046)>
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    
    DW_TAG_subrange_type      <8055 (CU 0@0+8055)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 16
  
  DW_TAG_variable           <8062 (CU 0@0+8062)>
  DW_AT_name           (03;strp) K_COEFF
  DW_AT_type           (49;ref4) <8046 (CU 0@0+8046)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 148
  DW_AT_location       (02;blk1) (DW_OP_addr 0x00019040)
  
  DW_TAG_variable           <8080 (CU 0@0+8080)>
  DW_AT_name           (03;strp) nb_pkt
  DW_AT_type           (49;ref4) <7840 (CU 0@0+7840)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 102
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001a5f8)
  
  DW_TAG_array_type         <8098 (CU 0@0+8098)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <8107 (CU 0@0+8107)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 31
  
  DW_TAG_variable           <8114 (CU 0@0+8114)>
  DW_AT_name           (03;strp) ZERO
  DW_AT_type           (49;ref4) <8098 (CU 0@0+8098)>
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 80
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001a0d0)
  
  DW_TAG_variable           <8131 (CU 0@0+8131)>
  DW_AT_name           (03;strp) nb_eof
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 101
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001a5fc)
  
  DW_TAG_array_type         <8149 (CU 0@0+8149)>
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    
    DW_TAG_subrange_type      <8158 (CU 0@0+8158)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 0
  
  DW_TAG_variable           <8165 (CU 0@0+8165)>
  DW_AT_name           (03;strp) PTW_DEFAULTWEIGHT
  DW_AT_type           (49;ref4) <8149 (CU 0@0+8149)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 153
  DW_AT_location       (02;blk1) (DW_OP_addr 0x00019084)
  
  DW_TAG_variable           <8183 (CU 0@0+8183)>
  DW_AT_name           (03;strn) id
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 110
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001a600)
  
  DW_TAG_const_type         <8200 (CU 0@0+8200)>
  DW_AT_type           (49;ref4) <6919 (CU 0@0+6919)>
  DW_AT_byte_size      (0B;dat1) 0x00000001
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_pointer_type       <8208 (CU 0@0+8208)>
  DW_AT_type           (49;ref4) <8200 (CU 0@0+8200)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_pointer_type       <8216 (CU 0@0+8216)>
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_structure_type     <8224 (CU 0@0+8224)>
  DW_AT_name           (03;strp) option
  DW_AT_byte_size      (0B;dat1) 0x00000010
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 54
    
    DW_TAG_member             <8236 (CU 0@0+8236)>
    DW_AT_name           (03;strp) name
    DW_AT_type           (49;ref4) <8208 (CU 0@0+8208)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 56
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <8250 (CU 0@0+8250)>
    DW_AT_name           (03;strp) has_arg
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 61
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
    
    DW_TAG_member             <8264 (CU 0@0+8264)>
    DW_AT_name           (03;strp) flag
    DW_AT_type           (49;ref4) <8216 (CU 0@0+8216)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 63
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 8)
    
    DW_TAG_member             <8278 (CU 0@0+8278)>
    DW_AT_name           (03;strp) val
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 65
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 12)
  
  DW_TAG_array_type         <8293 (CU 0@0+8293)>
  DW_AT_type           (49;ref4) <8224 (CU 0@0+8224)>
    
    DW_TAG_subrange_type      <8302 (CU 0@0+8302)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 9
  
  DW_TAG_array_type         <8309 (CU 0@0+8309)>
  DW_AT_type           (49;ref4) <6919 (CU 0@0+6919)>
    
    DW_TAG_subrange_type      <8318 (CU 0@0+8318)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat2) 1798
  
  DW_TAG_variable           <8326 (CU 0@0+8326)>
  DW_AT_name           (03;strp) usage
  DW_AT_type           (49;ref4) <8309 (CU 0@0+8309)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 175
  DW_AT_location       (02;blk1) (DW_OP_addr 0x00019140)
  
  DW_TAG_variable           <8344 (CU 0@0+8344)>
  DW_AT_name           (03;strp) intr_read
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 228
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001a604)
  
  DW_TAG_variable           <8362 (CU 0@0+8362)>
  DW_AT_name           (03;strp) wpa_wordlists_done
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 113
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001a608)
  
  DW_TAG_variable           <8380 (CU 0@0+8380)>
  DW_AT_name           (03;strp) mx_nb
  DW_AT_type           (49;ref4) <7907 (CU 0@0+7907)>
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 114
  DW_AT_location       (02;blk1) (DW_OP_addr 0x00019860)
  
  DW_TAG_array_type         <8397 (CU 0@0+8397)>
  DW_AT_type           (49;ref4) <6919 (CU 0@0+6919)>
    
    DW_TAG_subrange_type      <8406 (CU 0@0+8406)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 32
  
  DW_TAG_array_type         <8413 (CU 0@0+8413)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <8422 (CU 0@0+8422)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 5
  
  DW_TAG_array_type         <8429 (CU 0@0+8429)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <8438 (CU 0@0+8438)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 63
  
  DW_TAG_pointer_type       <8445 (CU 0@0+8445)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_base_type          <8453 (CU 0@0+8453)>
  DW_AT_encoding       (3E;dat1) DW_ATE_signed
  DW_AT_name           (03;strp) short int
  DW_AT_byte_size      (0B;dat1) 0x00000002
  
  DW_TAG_structure_type     <8460 (CU 0@0+8460)>
  DW_AT_name           (03;strp) __sbuf
  DW_AT_byte_size      (0B;dat1) 0x00000008
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 96
    
    DW_TAG_member             <8472 (CU 0@0+8472)>
    DW_AT_name           (03;strp) _base
    DW_AT_type           (49;ref4) <8445 (CU 0@0+8445)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 97
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <8486 (CU 0@0+8486)>
    DW_AT_name           (03;strp) _size
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 98
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
  
  DW_TAG_subroutine_type    <8501 (CU 0@0+8501)>
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
  DW_AT_prototyped     (27;flag) yes(1)
    
    DW_TAG_formal_parameter   <8511 (CU 0@0+8511)>
    DW_AT_type           (49;ref4) <390 (CU 0@0+390)>
  
  DW_TAG_pointer_type       <8517 (CU 0@0+8517)>
  DW_AT_type           (49;ref4) <8501 (CU 0@0+8501)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_subroutine_type    <8525 (CU 0@0+8525)>
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
  DW_AT_prototyped     (27;flag) yes(1)
    
    DW_TAG_formal_parameter   <8535 (CU 0@0+8535)>
    DW_AT_type           (49;ref4) <390 (CU 0@0+390)>
    
    DW_TAG_formal_parameter   <8540 (CU 0@0+8540)>
    DW_AT_type           (49;ref4) <6926 (CU 0@0+6926)>
    
    DW_TAG_formal_parameter   <8545 (CU 0@0+8545)>
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
  
  DW_TAG_pointer_type       <8551 (CU 0@0+8551)>
  DW_AT_type           (49;ref4) <8525 (CU 0@0+8525)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_base_type          <8559 (CU 0@0+8559)>
  DW_AT_encoding       (3E;dat1) DW_ATE_signed
  DW_AT_name           (03;strp) long long int
  DW_AT_byte_size      (0B;dat1) 0x00000008
  
  DW_TAG_typedef            <8566 (CU 0@0+8566)>
  DW_AT_type           (49;ref4) <8559 (CU 0@0+8559)>
  DW_AT_name           (03;strp) fpos_t
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 96
  
  DW_TAG_subroutine_type    <8577 (CU 0@0+8577)>
  DW_AT_type           (49;ref4) <8566 (CU 0@0+8566)>
  DW_AT_prototyped     (27;flag) yes(1)
    
    DW_TAG_formal_parameter   <8587 (CU 0@0+8587)>
    DW_AT_type           (49;ref4) <390 (CU 0@0+390)>
    
    DW_TAG_formal_parameter   <8592 (CU 0@0+8592)>
    DW_AT_type           (49;ref4) <8566 (CU 0@0+8566)>
    
    DW_TAG_formal_parameter   <8597 (CU 0@0+8597)>
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
  
  DW_TAG_pointer_type       <8603 (CU 0@0+8603)>
  DW_AT_type           (49;ref4) <8577 (CU 0@0+8577)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_subroutine_type    <8611 (CU 0@0+8611)>
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
  DW_AT_prototyped     (27;flag) yes(1)
    
    DW_TAG_formal_parameter   <8621 (CU 0@0+8621)>
    DW_AT_type           (49;ref4) <390 (CU 0@0+390)>
    
    DW_TAG_formal_parameter   <8626 (CU 0@0+8626)>
    DW_AT_type           (49;ref4) <8208 (CU 0@0+8208)>
    
    DW_TAG_formal_parameter   <8631 (CU 0@0+8631)>
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
  
  DW_TAG_pointer_type       <8637 (CU 0@0+8637)>
  DW_AT_type           (49;ref4) <8611 (CU 0@0+8611)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_structure_type     <8645 (CU 0@0+8645)>
  DW_AT_name           (03;strp) __sFILEX
  DW_AT_declaration    (3C;flag) yes(1)
  
  DW_TAG_pointer_type       <8651 (CU 0@0+8651)>
  DW_AT_type           (49;ref4) <8645 (CU 0@0+8645)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_array_type         <8659 (CU 0@0+8659)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <8668 (CU 0@0+8668)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 2
  
  DW_TAG_array_type         <8675 (CU 0@0+8675)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <8684 (CU 0@0+8684)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 0
  
  DW_TAG_structure_type     <8691 (CU 0@0+8691)>
  DW_AT_name           (03;strp) __sFILE
  DW_AT_byte_size      (0B;dat1) 0x00000058
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 130
    
    DW_TAG_member             <8703 (CU 0@0+8703)>
    DW_AT_name           (03;strn) _p
    DW_AT_type           (49;ref4) <8445 (CU 0@0+8445)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 131
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <8716 (CU 0@0+8716)>
    DW_AT_name           (03;strn) _r
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 132
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
    
    DW_TAG_member             <8729 (CU 0@0+8729)>
    DW_AT_name           (03;strn) _w
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 133
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 8)
    
    DW_TAG_member             <8742 (CU 0@0+8742)>
    DW_AT_name           (03;strp) _flags
    DW_AT_type           (49;ref4) <8453 (CU 0@0+8453)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 134
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 12)
    
    DW_TAG_member             <8756 (CU 0@0+8756)>
    DW_AT_name           (03;strp) _file
    DW_AT_type           (49;ref4) <8453 (CU 0@0+8453)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 135
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 14)
    
    DW_TAG_member             <8770 (CU 0@0+8770)>
    DW_AT_name           (03;strp) _bf
    DW_AT_type           (49;ref4) <8460 (CU 0@0+8460)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 136
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 16)
    
    DW_TAG_member             <8784 (CU 0@0+8784)>
    DW_AT_name           (03;strp) _lbfsize
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 137
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 24)
    
    DW_TAG_member             <8798 (CU 0@0+8798)>
    DW_AT_name           (03;strp) _cookie
    DW_AT_type           (49;ref4) <390 (CU 0@0+390)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 140
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 28)
    
    DW_TAG_member             <8812 (CU 0@0+8812)>
    DW_AT_name           (03;strp) _close
    DW_AT_type           (49;ref4) <8517 (CU 0@0+8517)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 141
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 32)
    
    DW_TAG_member             <8826 (CU 0@0+8826)>
    DW_AT_name           (03;strp) _read
    DW_AT_type           (49;ref4) <8551 (CU 0@0+8551)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 142
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 36)
    
    DW_TAG_member             <8840 (CU 0@0+8840)>
    DW_AT_name           (03;strp) _seek
    DW_AT_type           (49;ref4) <8603 (CU 0@0+8603)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 143
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 40)
    
    DW_TAG_member             <8854 (CU 0@0+8854)>
    DW_AT_name           (03;strp) _write
    DW_AT_type           (49;ref4) <8637 (CU 0@0+8637)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 144
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 44)
    
    DW_TAG_member             <8868 (CU 0@0+8868)>
    DW_AT_name           (03;strp) _ub
    DW_AT_type           (49;ref4) <8460 (CU 0@0+8460)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 147
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 48)
    
    DW_TAG_member             <8882 (CU 0@0+8882)>
    DW_AT_name           (03;strp) _extra
    DW_AT_type           (49;ref4) <8651 (CU 0@0+8651)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 148
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 56)
    
    DW_TAG_member             <8896 (CU 0@0+8896)>
    DW_AT_name           (03;strp) _ur
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 149
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 60)
    
    DW_TAG_member             <8910 (CU 0@0+8910)>
    DW_AT_name           (03;strp) _ubuf
    DW_AT_type           (49;ref4) <8659 (CU 0@0+8659)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 152
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 64)
    
    DW_TAG_member             <8924 (CU 0@0+8924)>
    DW_AT_name           (03;strp) _nbuf
    DW_AT_type           (49;ref4) <8675 (CU 0@0+8675)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 153
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 67)
    
    DW_TAG_member             <8938 (CU 0@0+8938)>
    DW_AT_name           (03;strp) _lb
    DW_AT_type           (49;ref4) <8460 (CU 0@0+8460)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 156
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 68)
    
    DW_TAG_member             <8952 (CU 0@0+8952)>
    DW_AT_name           (03;strp) _blksize
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 159
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 76)
    
    DW_TAG_member             <8966 (CU 0@0+8966)>
    DW_AT_name           (03;strp) _offset
    DW_AT_type           (49;ref4) <8566 (CU 0@0+8566)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 160
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 80)
  
  DW_TAG_typedef            <8981 (CU 0@0+8981)>
  DW_AT_type           (49;ref4) <8691 (CU 0@0+8691)>
  DW_AT_name           (03;strp) FILE
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat2) 352
  
  DW_TAG_pointer_type       <8993 (CU 0@0+8993)>
  DW_AT_type           (49;ref4) <8981 (CU 0@0+8981)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_array_type         <9001 (CU 0@0+9001)>
  DW_AT_type           (49;ref4) <6919 (CU 0@0+6919)>
    
    DW_TAG_subrange_type      <9010 (CU 0@0+9010)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 1
  
  DW_TAG_structure_type     <9017 (CU 0@0+9017)>
  DW_AT_name           (03;strp) mergeBSSID
  DW_AT_byte_size      (0B;dat1) 0x00000010
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 136
    
    DW_TAG_member             <9029 (CU 0@0+9029)>
    DW_AT_name           (03;strp) bssid
    DW_AT_type           (49;ref4) <8413 (CU 0@0+8413)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 215
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <9043 (CU 0@0+9043)>
    DW_AT_name           (03;strp) unused
    DW_AT_type           (49;ref4) <9001 (CU 0@0+9001)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 216
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 6)
    
    DW_TAG_member             <9057 (CU 0@0+9057)>
    DW_AT_name           (03;strp) convert
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 217
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 8)
    
    DW_TAG_member             <9071 (CU 0@0+9071)>
    DW_AT_name           (03;strp) next
    DW_AT_type           (49;ref4) <9086 (CU 0@0+9086)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 219
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 12)
  
  DW_TAG_pointer_type       <9086 (CU 0@0+9086)>
  DW_AT_type           (49;ref4) <9017 (CU 0@0+9017)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_array_type         <9094 (CU 0@0+9094)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <9103 (CU 0@0+9103)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 3
  
  DW_TAG_pointer_type       <9110 (CU 0@0+9110)>
  DW_AT_type           (49;ref4) <8445 (CU 0@0+8445)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_array_type         <9118 (CU 0@0+9118)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <9127 (CU 0@0+9127)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 15
  
  DW_TAG_structure_type     <9134 (CU 0@0+9134)>
  DW_AT_name           (03;strp) WPA_hdsk
  DW_AT_byte_size      (0B;dat2) 0x00000164
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 173
    
    DW_TAG_member             <9147 (CU 0@0+9147)>
    DW_AT_name           (03;strp) stmac
    DW_AT_type           (49;ref4) <8413 (CU 0@0+8413)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 174
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <9161 (CU 0@0+9161)>
    DW_AT_name           (03;strp) snonce
    DW_AT_type           (49;ref4) <8098 (CU 0@0+8098)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 175
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 6)
    
    DW_TAG_member             <9175 (CU 0@0+9175)>
    DW_AT_name           (03;strp) anonce
    DW_AT_type           (49;ref4) <8098 (CU 0@0+8098)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 176
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 38)
    
    DW_TAG_member             <9189 (CU 0@0+9189)>
    DW_AT_name           (03;strp) keymic
    DW_AT_type           (49;ref4) <9118 (CU 0@0+9118)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 177
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 70)
    
    DW_TAG_member             <9203 (CU 0@0+9203)>
    DW_AT_name           (03;strp) eapol
    DW_AT_type           (49;ref4) <7995 (CU 0@0+7995)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 178
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 86)
    
    DW_TAG_member             <9217 (CU 0@0+9217)>
    DW_AT_name           (03;strp) eapol_size
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 179
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 344)
    
    DW_TAG_member             <9232 (CU 0@0+9232)>
    DW_AT_name           (03;strp) keyver
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 180
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 348)
    
    DW_TAG_member             <9247 (CU 0@0+9247)>
    DW_AT_name           (03;strp) state
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 181
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 352)
  
  DW_TAG_structure_type     <9263 (CU 0@0+9263)>
  DW_AT_name           (03;strp) ST_info
  DW_AT_byte_size      (0B;dat2) 0x00000174
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 199
    
    DW_TAG_member             <9276 (CU 0@0+9276)>
    DW_AT_name           (03;strn) ap
    DW_AT_type           (49;ref4) <9956 (CU 0@0+9956)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 207
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <9289 (CU 0@0+9289)>
    DW_AT_name           (03;strp) next
    DW_AT_type           (49;ref4) <9333 (CU 0@0+9333)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 208
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
    
    DW_TAG_member             <9303 (CU 0@0+9303)>
    DW_AT_name           (03;strp) wpa
    DW_AT_type           (49;ref4) <9134 (CU 0@0+9134)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 209
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 8)
    
    DW_TAG_member             <9317 (CU 0@0+9317)>
    DW_AT_name           (03;strp) stmac
    DW_AT_type           (49;ref4) <8413 (CU 0@0+8413)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 210
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 364)
  
  DW_TAG_pointer_type       <9333 (CU 0@0+9333)>
  DW_AT_type           (49;ref4) <9263 (CU 0@0+9263)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_typedef            <9341 (CU 0@0+9341)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
  DW_AT_name           (03;strp) uint8_t
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 45
  
  DW_TAG_array_type         <9352 (CU 0@0+9352)>
  DW_AT_type           (49;ref4) <9341 (CU 0@0+9341)>
    
    DW_TAG_subrange_type      <9361 (CU 0@0+9361)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat4) 2097151
  
  DW_TAG_array_type         <9371 (CU 0@0+9371)>
  DW_AT_type           (49;ref4) <9341 (CU 0@0+9341)>
    
    DW_TAG_subrange_type      <9380 (CU 0@0+9380)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 2
  
  DW_TAG_array_type         <9387 (CU 0@0+9387)>
  DW_AT_type           (49;ref4) <9341 (CU 0@0+9341)>
    
    DW_TAG_subrange_type      <9396 (CU 0@0+9396)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 31
  
  DW_TAG_structure_type     <9403 (CU 0@0+9403)>
  DW_AT_byte_size      (0B;dat1) 0x00000028
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 44
    
    DW_TAG_member             <9411 (CU 0@0+9411)>
    DW_AT_name           (03;strn) iv
    DW_AT_type           (49;ref4) <9371 (CU 0@0+9371)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 46
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <9424 (CU 0@0+9424)>
    DW_AT_name           (03;strp) keystream
    DW_AT_type           (49;ref4) <9387 (CU 0@0+9387)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 48
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 3)
    
    DW_TAG_member             <9438 (CU 0@0+9438)>
    DW_AT_name           (03;strp) weight
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 50
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 36)
  
  DW_TAG_typedef            <9453 (CU 0@0+9453)>
  DW_AT_type           (49;ref4) <9403 (CU 0@0+9403)>
  DW_AT_name           (03;strp) PTW_session
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 55
  
  DW_TAG_array_type         <9464 (CU 0@0+9464)>
  DW_AT_type           (49;ref4) <9453 (CU 0@0+9453)>
    
    DW_TAG_subrange_type      <9473 (CU 0@0+9473)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat2) 9999
  
  DW_TAG_structure_type     <9481 (CU 0@0+9481)>
  DW_AT_byte_size      (0B;dat1) 0x00000008
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 36
    
    DW_TAG_member             <9489 (CU 0@0+9489)>
    DW_AT_name           (03;strp) votes
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 38
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <9503 (CU 0@0+9503)>
    DW_AT_name           (03;strn) b
    DW_AT_type           (49;ref4) <9341 (CU 0@0+9341)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 40
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
  
  DW_TAG_typedef            <9516 (CU 0@0+9516)>
  DW_AT_type           (49;ref4) <9481 (CU 0@0+9481)>
  DW_AT_name           (03;strp) PTW_tableentry
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 44
  
  DW_TAG_array_type         <9527 (CU 0@0+9527)>
  DW_AT_type           (49;ref4) <9516 (CU 0@0+9516)>
    
    DW_TAG_subrange_type      <9536 (CU 0@0+9536)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 28
    
    DW_TAG_subrange_type      <9542 (CU 0@0+9542)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat2) 255
  
  DW_TAG_pointer_type       <9550 (CU 0@0+9550)>
  DW_AT_type           (49;ref4) <9453 (CU 0@0+9453)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_structure_type     <9558 (CU 0@0+9558)>
  DW_AT_byte_size      (0B;dat4) 0x00270290
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 55
    
    DW_TAG_member             <9569 (CU 0@0+9569)>
    DW_AT_name           (03;strp) packets_collected
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 57
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <9583 (CU 0@0+9583)>
    DW_AT_name           (03;strp) seen_iv
    DW_AT_type           (49;ref4) <9352 (CU 0@0+9352)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 59
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
    
    DW_TAG_member             <9597 (CU 0@0+9597)>
    DW_AT_name           (03;strp) sessions_collected
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 61
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 2097156)
    
    DW_TAG_member             <9614 (CU 0@0+9614)>
    DW_AT_name           (03;strp) sessions
    DW_AT_type           (49;ref4) <9464 (CU 0@0+9464)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 63
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 2097160)
    
    DW_TAG_member             <9631 (CU 0@0+9631)>
    DW_AT_name           (03;strp) table
    DW_AT_type           (49;ref4) <9527 (CU 0@0+9527)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 65
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 2497160)
    
    DW_TAG_member             <9648 (CU 0@0+9648)>
    DW_AT_name           (03;strp) allsessions
    DW_AT_type           (49;ref4) <9550 (CU 0@0+9550)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 67
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 2556552)
    
    DW_TAG_member             <9665 (CU 0@0+9665)>
    DW_AT_name           (03;strp) allsessions_size
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 68
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 2556556)
  
  DW_TAG_typedef            <9683 (CU 0@0+9683)>
  DW_AT_type           (49;ref4) <9558 (CU 0@0+9558)>
  DW_AT_name           (03;strp) PTW_attackstate
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 35
  
  DW_TAG_pointer_type       <9694 (CU 0@0+9694)>
  DW_AT_type           (49;ref4) <9683 (CU 0@0+9683)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_structure_type     <9702 (CU 0@0+9702)>
  DW_AT_name           (03;strp) AP_info
  DW_AT_byte_size      (0B;dat2) 0x000001c4
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 177
    
    DW_TAG_member             <9715 (CU 0@0+9715)>
    DW_AT_name           (03;strp) next
    DW_AT_type           (49;ref4) <9956 (CU 0@0+9956)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 186
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <9729 (CU 0@0+9729)>
    DW_AT_name           (03;strp) bssid
    DW_AT_type           (49;ref4) <8413 (CU 0@0+8413)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 187
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
    
    DW_TAG_member             <9743 (CU 0@0+9743)>
    DW_AT_name           (03;strp) essid
    DW_AT_type           (49;ref4) <8397 (CU 0@0+8397)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 188
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 10)
    
    DW_TAG_member             <9757 (CU 0@0+9757)>
    DW_AT_name           (03;strp) lanip
    DW_AT_type           (49;ref4) <9094 (CU 0@0+9094)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 189
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 43)
    
    DW_TAG_member             <9771 (CU 0@0+9771)>
    DW_AT_name           (03;strp) ivbuf
    DW_AT_type           (49;ref4) <8445 (CU 0@0+8445)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 190
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 48)
    
    DW_TAG_member             <9785 (CU 0@0+9785)>
    DW_AT_name           (03;strp) uiv_root
    DW_AT_type           (49;ref4) <9110 (CU 0@0+9110)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 191
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 52)
    
    DW_TAG_member             <9799 (CU 0@0+9799)>
    DW_AT_name           (03;strp) ivbuf_size
    DW_AT_type           (49;ref4) <7840 (CU 0@0+7840)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 192
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 56)
    
    DW_TAG_member             <9813 (CU 0@0+9813)>
    DW_AT_name           (03;strp) nb_ivs
    DW_AT_type           (49;ref4) <7840 (CU 0@0+7840)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 193
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 60)
    
    DW_TAG_member             <9827 (CU 0@0+9827)>
    DW_AT_name           (03;strp) nb_ivs_clean
    DW_AT_type           (49;ref4) <7840 (CU 0@0+7840)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 194
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 64)
    
    DW_TAG_member             <9841 (CU 0@0+9841)>
    DW_AT_name           (03;strp) nb_ivs_vague
    DW_AT_type           (49;ref4) <7840 (CU 0@0+7840)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 195
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 68)
    
    DW_TAG_member             <9855 (CU 0@0+9855)>
    DW_AT_name           (03;strp) crypt
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 196
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 72)
    
    DW_TAG_member             <9869 (CU 0@0+9869)>
    DW_AT_name           (03;strp) eapol
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 197
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 76)
    
    DW_TAG_member             <9883 (CU 0@0+9883)>
    DW_AT_name           (03;strp) target
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 198
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 80)
    
    DW_TAG_member             <9897 (CU 0@0+9897)>
    DW_AT_name           (03;strp) st_1st
    DW_AT_type           (49;ref4) <9333 (CU 0@0+9333)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 199
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 84)
    
    DW_TAG_member             <9911 (CU 0@0+9911)>
    DW_AT_name           (03;strp) wpa
    DW_AT_type           (49;ref4) <9134 (CU 0@0+9134)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 200
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 88)
    
    DW_TAG_member             <9925 (CU 0@0+9925)>
    DW_AT_name           (03;strp) ptw_clean
    DW_AT_type           (49;ref4) <9694 (CU 0@0+9694)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 201
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 444)
    
    DW_TAG_member             <9940 (CU 0@0+9940)>
    DW_AT_name           (03;strp) ptw_vague
    DW_AT_type           (49;ref4) <9694 (CU 0@0+9694)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 202
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 448)
  
  DW_TAG_pointer_type       <9956 (CU 0@0+9956)>
  DW_AT_type           (49;ref4) <9702 (CU 0@0+9702)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_typedef            <9964 (CU 0@0+9964)>
  DW_AT_type           (49;ref4) <7840 (CU 0@0+7840)>
  DW_AT_name           (03;strp) __darwin_time_t
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 78
  
  DW_TAG_typedef            <9975 (CU 0@0+9975)>
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
  DW_AT_name           (03;strp) __darwin_suseconds_t
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 133
  
  DW_TAG_structure_type     <9986 (CU 0@0+9986)>
  DW_AT_name           (03;strp) timeval
  DW_AT_byte_size      (0B;dat1) 0x00000008
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 101
    
    DW_TAG_member             <9998 (CU 0@0+9998)>
    DW_AT_name           (03;strp) tv_sec
    DW_AT_type           (49;ref4) <9964 (CU 0@0+9964)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 102
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <10012 (CU 0@0+10012)>
    DW_AT_name           (03;strp) tv_usec
    DW_AT_type           (49;ref4) <9975 (CU 0@0+9975)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 103
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
  
  DW_TAG_variable           <10027 (CU 0@0+10027)>
  DW_AT_name           (03;strp) t_begin
  DW_AT_type           (49;ref4) <9986 (CU 0@0+9986)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 88
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001c348)
  
  DW_TAG_variable           <10045 (CU 0@0+10045)>
  DW_AT_name           (03;strp) t_stats
  DW_AT_type           (49;ref4) <9986 (CU 0@0+9986)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 89
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001c358)
  
  DW_TAG_variable           <10063 (CU 0@0+10063)>
  DW_AT_name           (03;strp) t_kprev
  DW_AT_type           (49;ref4) <9986 (CU 0@0+9986)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 90
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001c350)
  
  DW_TAG_variable           <10081 (CU 0@0+10081)>
  DW_AT_name           (03;strp) nb_kprev
  DW_AT_type           (49;ref4) <8559 (CU 0@0+8559)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 91
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001c330)
  
  DW_TAG_variable           <10099 (CU 0@0+10099)>
  DW_AT_name           (03;strp) nb_tried
  DW_AT_type           (49;ref4) <8559 (CU 0@0+8559)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 92
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001c338)
  
  DW_TAG_variable           <10117 (CU 0@0+10117)>
  DW_AT_name           (03;strp) ap_1st
  DW_AT_type           (49;ref4) <9956 (CU 0@0+9956)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 96
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001a60c)
  
  DW_TAG_variable           <10135 (CU 0@0+10135)>
  DW_AT_name           (03;strp) mx_apl
  DW_AT_type           (49;ref4) <7907 (CU 0@0+7907)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 97
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001c280)
  
  DW_TAG_variable           <10153 (CU 0@0+10153)>
  DW_AT_name           (03;strp) mx_eof
  DW_AT_type           (49;ref4) <7907 (CU 0@0+7907)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 98
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001c2c0)
  
  DW_TAG_variable           <10171 (CU 0@0+10171)>
  DW_AT_name           (03;strp) mx_ivb
  DW_AT_type           (49;ref4) <7907 (CU 0@0+7907)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 99
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001c300)
  
  DW_TAG_array_type         <10189 (CU 0@0+10189)>
  DW_AT_type           (49;ref4) <6919 (CU 0@0+6919)>
    
    DW_TAG_subrange_type      <10198 (CU 0@0+10198)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 23
  
  DW_TAG_structure_type     <10205 (CU 0@0+10205)>
  DW_AT_name           (03;strp) _opaque_pthread_cond_t
  DW_AT_byte_size      (0B;dat1) 0x0000001c
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 65
    
    DW_TAG_member             <10217 (CU 0@0+10217)>
    DW_AT_name           (03;strp) __sig
    DW_AT_type           (49;ref4) <7840 (CU 0@0+7840)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 65
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <10231 (CU 0@0+10231)>
    DW_AT_name           (03;strp) __opaque
    DW_AT_type           (49;ref4) <10189 (CU 0@0+10189)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 65
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
  
  DW_TAG_typedef            <10246 (CU 0@0+10246)>
  DW_AT_type           (49;ref4) <10205 (CU 0@0+10205)>
  DW_AT_name           (03;strp) pthread_cond_t
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat2) 326
  
  DW_TAG_variable           <10258 (CU 0@0+10258)>
  DW_AT_name           (03;strp) cv_eof
  DW_AT_type           (49;ref4) <10246 (CU 0@0+10246)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 100
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001ba60)
  
  DW_TAG_array_type         <10276 (CU 0@0+10276)>
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    
    DW_TAG_subrange_type      <10285 (CU 0@0+10285)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat2) 255
    
    DW_TAG_subrange_type      <10292 (CU 0@0+10292)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 1
  
  DW_TAG_variable           <10299 (CU 0@0+10299)>
  DW_AT_name           (03;strp) mc_pipe
  DW_AT_type           (49;ref4) <10276 (CU 0@0+10276)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 103
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001ba80)
  
  DW_TAG_variable           <10317 (CU 0@0+10317)>
  DW_AT_name           (03;strp) cm_pipe
  DW_AT_type           (49;ref4) <10276 (CU 0@0+10276)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 104
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001b260)
  
  DW_TAG_variable           <10335 (CU 0@0+10335)>
  DW_AT_name           (03;strp) bf_pipe
  DW_AT_type           (49;ref4) <10276 (CU 0@0+10276)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 105
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001aa20)
  
  DW_TAG_array_type         <10353 (CU 0@0+10353)>
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    
    DW_TAG_subrange_type      <10362 (CU 0@0+10362)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat2) 255
  
  DW_TAG_variable           <10370 (CU 0@0+10370)>
  DW_AT_name           (03;strp) bf_nkeys
  DW_AT_type           (49;ref4) <10353 (CU 0@0+10353)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 106
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001a620)
  
  DW_TAG_variable           <10388 (CU 0@0+10388)>
  DW_AT_name           (03;strp) bf_wepkey
  DW_AT_type           (49;ref4) <8429 (CU 0@0+8429)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 107
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001b220)
  
  DW_TAG_subroutine_type    <10406 (CU 0@0+10406)>
  DW_AT_prototyped     (27;flag) yes(1)
    
    DW_TAG_formal_parameter   <10412 (CU 0@0+10412)>
    DW_AT_type           (49;ref4) <390 (CU 0@0+390)>
  
  DW_TAG_pointer_type       <10418 (CU 0@0+10418)>
  DW_AT_type           (49;ref4) <10406 (CU 0@0+10406)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_structure_type     <10426 (CU 0@0+10426)>
  DW_AT_name           (03;strp) __darwin_pthread_handler_rec
  DW_AT_byte_size      (0B;dat1) 0x0000000c
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 59
    
    DW_TAG_member             <10438 (CU 0@0+10438)>
    DW_AT_name           (03;strp) __routine
    DW_AT_type           (49;ref4) <10418 (CU 0@0+10418)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 60
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <10452 (CU 0@0+10452)>
    DW_AT_name           (03;strp) __arg
    DW_AT_type           (49;ref4) <390 (CU 0@0+390)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 61
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
    
    DW_TAG_member             <10466 (CU 0@0+10466)>
    DW_AT_name           (03;strp) __next
    DW_AT_type           (49;ref4) <10481 (CU 0@0+10481)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 62
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 8)
  
  DW_TAG_pointer_type       <10481 (CU 0@0+10481)>
  DW_AT_type           (49;ref4) <10426 (CU 0@0+10426)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_array_type         <10489 (CU 0@0+10489)>
  DW_AT_type           (49;ref4) <6919 (CU 0@0+6919)>
    
    DW_TAG_subrange_type      <10498 (CU 0@0+10498)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat2) 595
  
  DW_TAG_structure_type     <10506 (CU 0@0+10506)>
  DW_AT_name           (03;strp) _opaque_pthread_t
  DW_AT_byte_size      (0B;dat2) 0x0000025c
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 72
    
    DW_TAG_member             <10519 (CU 0@0+10519)>
    DW_AT_name           (03;strp) __sig
    DW_AT_type           (49;ref4) <7840 (CU 0@0+7840)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 72
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <10533 (CU 0@0+10533)>
    DW_AT_name           (03;strp) __cleanup_stack
    DW_AT_type           (49;ref4) <10481 (CU 0@0+10481)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 72
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
    
    DW_TAG_member             <10547 (CU 0@0+10547)>
    DW_AT_name           (03;strp) __opaque
    DW_AT_type           (49;ref4) <10489 (CU 0@0+10489)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 72
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 8)
  
  DW_TAG_pointer_type       <10562 (CU 0@0+10562)>
  DW_AT_type           (49;ref4) <10506 (CU 0@0+10506)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_typedef            <10570 (CU 0@0+10570)>
  DW_AT_type           (49;ref4) <10562 (CU 0@0+10562)>
  DW_AT_name           (03;strp) pthread_t
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat2) 357
  
  DW_TAG_array_type         <10582 (CU 0@0+10582)>
  DW_AT_type           (49;ref4) <10570 (CU 0@0+10570)>
    
    DW_TAG_subrange_type      <10591 (CU 0@0+10591)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 127
  
  DW_TAG_variable           <10598 (CU 0@0+10598)>
  DW_AT_name           (03;strp) tid
  DW_AT_type           (49;ref4) <10582 (CU 0@0+10582)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 111
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001c360)
  
  DW_TAG_array_type         <10616 (CU 0@0+10616)>
  DW_AT_type           (49;ref4) <6919 (CU 0@0+6919)>
    
    DW_TAG_subrange_type      <10625 (CU 0@0+10625)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 127
  
  DW_TAG_structure_type     <10632 (CU 0@0+10632)>
  DW_AT_name           (03;strp) WPA_data
  DW_AT_byte_size      (0B;dat1) 0x000000e0
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 223
    
    DW_TAG_member             <10644 (CU 0@0+10644)>
    DW_AT_name           (03;strn) ap
    DW_AT_type           (49;ref4) <9956 (CU 0@0+9956)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 224
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <10657 (CU 0@0+10657)>
    DW_AT_name           (03;strp) thread
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 225
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
    
    DW_TAG_member             <10671 (CU 0@0+10671)>
    DW_AT_name           (03;strp) nkeys
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 226
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 8)
    
    DW_TAG_member             <10685 (CU 0@0+10685)>
    DW_AT_name           (03;strp) key_buffer
    DW_AT_type           (49;ref4) <6926 (CU 0@0+6926)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 227
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 12)
    
    DW_TAG_member             <10699 (CU 0@0+10699)>
    DW_AT_name           (03;strp) front
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 228
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 16)
    
    DW_TAG_member             <10713 (CU 0@0+10713)>
    DW_AT_name           (03;strp) back
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 229
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 20)
    
    DW_TAG_member             <10727 (CU 0@0+10727)>
    DW_AT_name           (03;strp) key
    DW_AT_type           (49;ref4) <10616 (CU 0@0+10616)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 230
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 24)
    
    DW_TAG_member             <10741 (CU 0@0+10741)>
    DW_AT_name           (03;strp) cond
    DW_AT_type           (49;ref4) <10246 (CU 0@0+10246)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 231
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 152)
    
    DW_TAG_member             <10756 (CU 0@0+10756)>
    DW_AT_name           (03;strp) mutex
    DW_AT_type           (49;ref4) <7907 (CU 0@0+7907)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 232
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 180)
  
  DW_TAG_array_type         <10772 (CU 0@0+10772)>
  DW_AT_type           (49;ref4) <10632 (CU 0@0+10632)>
    
    DW_TAG_subrange_type      <10781 (CU 0@0+10781)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 127
  
  DW_TAG_variable           <10788 (CU 0@0+10788)>
  DW_AT_name           (03;strp) wpa_data
  DW_AT_type           (49;ref4) <10772 (CU 0@0+10772)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 112
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001c560)
  
  DW_TAG_variable           <10806 (CU 0@0+10806)>
  DW_AT_name           (03;strp) progname
  DW_AT_type           (49;ref4) <6926 (CU 0@0+6926)>
  DW_AT_external       (3F;flag) yes(1)
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 227
  DW_AT_location       (02;blk1) (DW_OP_addr 0x0001c340)
  
  DW_TAG_pointer_type       <10824 (CU 0@0+10824)>
  DW_AT_type           (49;ref4) <10632 (CU 0@0+10632)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_pointer_type       <10832 (CU 0@0+10832)>
  DW_AT_type           (49;ref4) <9986 (CU 0@0+9986)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_pointer_type       <10840 (CU 0@0+10840)>
  DW_AT_type           (49;ref4) <6926 (CU 0@0+6926)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_base_type          <10848 (CU 0@0+10848)>
  DW_AT_encoding       (3E;dat1) DW_ATE_unsigned
  DW_AT_name           (03;strp) unsigned int
  DW_AT_byte_size      (0B;dat1) 0x00000004
  
  DW_TAG_array_type         <10855 (CU 0@0+10855)>
  DW_AT_type           (49;ref4) <6919 (CU 0@0+6919)>
    
    DW_TAG_subrange_type      <10864 (CU 0@0+10864)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 27
  
  DW_TAG_array_type         <10871 (CU 0@0+10871)>
  DW_AT_type           (49;ref4) <9516 (CU 0@0+9516)>
    
    DW_TAG_subrange_type      <10880 (CU 0@0+10880)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat2) 255
  
  DW_TAG_pointer_type       <10888 (CU 0@0+10888)>
  DW_AT_type           (49;ref4) <10871 (CU 0@0+10871)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_structure_type     <10896 (CU 0@0+10896)>
  DW_AT_name           (03;strp) winsize
  DW_AT_byte_size      (0B;dat1) 0x00000008
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 83
    
    DW_TAG_member             <10908 (CU 0@0+10908)>
    DW_AT_name           (03;strp) ws_row
    DW_AT_type           (49;ref4) <7833 (CU 0@0+7833)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 84
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <10922 (CU 0@0+10922)>
    DW_AT_name           (03;strp) ws_col
    DW_AT_type           (49;ref4) <7833 (CU 0@0+7833)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 85
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 2)
    
    DW_TAG_member             <10936 (CU 0@0+10936)>
    DW_AT_name           (03;strp) ws_xpixel
    DW_AT_type           (49;ref4) <7833 (CU 0@0+7833)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 86
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
    
    DW_TAG_member             <10950 (CU 0@0+10950)>
    DW_AT_name           (03;strp) ws_ypixel
    DW_AT_type           (49;ref4) <7833 (CU 0@0+7833)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 87
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 6)
  
  DW_TAG_base_type          <10965 (CU 0@0+10965)>
  DW_AT_encoding       (3E;dat1) DW_ATE_unsigned
  DW_AT_name           (03;strp) long unsigned int
  DW_AT_byte_size      (0B;dat1) 0x00000004
  
  DW_TAG_typedef            <10972 (CU 0@0+10972)>
  DW_AT_type           (49;ref4) <10965 (CU 0@0+10965)>
  DW_AT_name           (03;strp) size_t
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 235
  
  DW_TAG_array_type         <10983 (CU 0@0+10983)>
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    
    DW_TAG_subrange_type      <10992 (CU 0@0+10992)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 16
    
    DW_TAG_subrange_type      <10998 (CU 0@0+10998)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat2) 255
  
  DW_TAG_array_type         <11006 (CU 0@0+11006)>
  DW_AT_type           (49;ref4) <6919 (CU 0@0+6919)>
    
    DW_TAG_subrange_type      <11015 (CU 0@0+11015)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 3
  
  DW_TAG_structure_type     <11022 (CU 0@0+11022)>
  DW_AT_byte_size      (0B;dat1) 0x00000010
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 139
    
    DW_TAG_member             <11030 (CU 0@0+11030)>
    DW_AT_name           (03;strp) off1
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 140
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <11044 (CU 0@0+11044)>
    DW_AT_name           (03;strp) off2
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 141
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
    
    DW_TAG_member             <11058 (CU 0@0+11058)>
    DW_AT_name           (03;strp) buf1
    DW_AT_type           (49;ref4) <390 (CU 0@0+390)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 142
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 8)
    
    DW_TAG_member             <11072 (CU 0@0+11072)>
    DW_AT_name           (03;strp) buf2
    DW_AT_type           (49;ref4) <390 (CU 0@0+390)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 143
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 12)
  
  DW_TAG_typedef            <11087 (CU 0@0+11087)>
  DW_AT_type           (49;ref4) <11022 (CU 0@0+11022)>
  DW_AT_name           (03;strp) read_buf
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat2) 2907
  
  DW_TAG_pointer_type       <11099 (CU 0@0+11099)>
  DW_AT_type           (49;ref4) <11087 (CU 0@0+11087)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_structure_type     <11107 (CU 0@0+11107)>
  DW_AT_name           (03;strp) ivs2_pkthdr
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 74
    
    DW_TAG_member             <11119 (CU 0@0+11119)>
    DW_AT_name           (03;strp) flags
    DW_AT_type           (49;ref4) <7833 (CU 0@0+7833)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 75
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <11133 (CU 0@0+11133)>
    DW_AT_name           (03;strp) len
    DW_AT_type           (49;ref4) <7833 (CU 0@0+7833)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 76
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 2)
  
  DW_TAG_structure_type     <11148 (CU 0@0+11148)>
  DW_AT_name           (03;strp) ivs2_filehdr
  DW_AT_byte_size      (0B;dat1) 0x00000002
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 69
    
    DW_TAG_member             <11160 (CU 0@0+11160)>
    DW_AT_name           (03;strp) version
    DW_AT_type           (49;ref4) <7833 (CU 0@0+7833)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 70
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
  
  DW_TAG_structure_type     <11175 (CU 0@0+11175)>
  DW_AT_name           (03;strp) pcap_pkthdr
  DW_AT_byte_size      (0B;dat1) 0x00000010
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 61
    
    DW_TAG_member             <11187 (CU 0@0+11187)>
    DW_AT_name           (03;strp) tv_sec
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 62
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <11201 (CU 0@0+11201)>
    DW_AT_name           (03;strp) tv_usec
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 63
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
    
    DW_TAG_member             <11215 (CU 0@0+11215)>
    DW_AT_name           (03;strp) caplen
    DW_AT_type           (49;ref4) <10848 (CU 0@0+10848)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 64
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 8)
    
    DW_TAG_member             <11229 (CU 0@0+11229)>
    DW_AT_name           (03;strp) len
    DW_AT_type           (49;ref4) <10848 (CU 0@0+10848)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 65
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 12)
  
  DW_TAG_structure_type     <11244 (CU 0@0+11244)>
  DW_AT_name           (03;strp) pcap_file_header
  DW_AT_byte_size      (0B;dat1) 0x00000018
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 50
    
    DW_TAG_member             <11256 (CU 0@0+11256)>
    DW_AT_name           (03;strp) magic
    DW_AT_type           (49;ref4) <10848 (CU 0@0+10848)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 51
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 0)
    
    DW_TAG_member             <11270 (CU 0@0+11270)>
    DW_AT_name           (03;strp) version_major
    DW_AT_type           (49;ref4) <7833 (CU 0@0+7833)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 52
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 4)
    
    DW_TAG_member             <11284 (CU 0@0+11284)>
    DW_AT_name           (03;strp) version_minor
    DW_AT_type           (49;ref4) <7833 (CU 0@0+7833)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 53
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 6)
    
    DW_TAG_member             <11298 (CU 0@0+11298)>
    DW_AT_name           (03;strp) thiszone
    DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 54
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 8)
    
    DW_TAG_member             <11312 (CU 0@0+11312)>
    DW_AT_name           (03;strp) sigfigs
    DW_AT_type           (49;ref4) <10848 (CU 0@0+10848)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 55
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 12)
    
    DW_TAG_member             <11326 (CU 0@0+11326)>
    DW_AT_name           (03;strp) snaplen
    DW_AT_type           (49;ref4) <10848 (CU 0@0+10848)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 56
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 16)
    
    DW_TAG_member             <11340 (CU 0@0+11340)>
    DW_AT_name           (03;strp) linktype
    DW_AT_type           (49;ref4) <10848 (CU 0@0+10848)>
    DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
    DW_AT_decl_line      (3B;dat1) 57
    DW_AT_data_member_location (38;blk1) (DW_OP_plus_uconst 20)
  
  DW_TAG_array_type         <11355 (CU 0@0+11355)>
  DW_AT_type           (49;ref4) <115 (CU 0@0+115)>
    
    DW_TAG_subrange_type      <11364 (CU 0@0+11364)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 15
  
  DW_TAG_array_type         <11371 (CU 0@0+11371)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <11380 (CU 0@0+11380)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat2) 2047
  
  DW_TAG_pointer_type       <11388 (CU 0@0+11388)>
  DW_AT_type           (49;ref4) <10353 (CU 0@0+10353)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_array_type         <11396 (CU 0@0+11396)>
  DW_AT_type           (49;ref4) <6919 (CU 0@0+6919)>
    
    DW_TAG_subrange_type      <11405 (CU 0@0+11405)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 35
  
  DW_TAG_array_type         <11412 (CU 0@0+11412)>
  DW_AT_type           (49;ref4) <6919 (CU 0@0+6919)>
    
    DW_TAG_subrange_type      <11421 (CU 0@0+11421)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 3
    
    DW_TAG_subrange_type      <11427 (CU 0@0+11427)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 127
  
  DW_TAG_array_type         <11434 (CU 0@0+11434)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <11443 (CU 0@0+11443)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 3
    
    DW_TAG_subrange_type      <11449 (CU 0@0+11449)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 127
  
  DW_TAG_array_type         <11456 (CU 0@0+11456)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <11465 (CU 0@0+11465)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 99
  
  DW_TAG_array_type         <11472 (CU 0@0+11472)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <11481 (CU 0@0+11481)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 3
    
    DW_TAG_subrange_type      <11487 (CU 0@0+11487)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 79
  
  DW_TAG_array_type         <11494 (CU 0@0+11494)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <11503 (CU 0@0+11503)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 3
    
    DW_TAG_subrange_type      <11509 (CU 0@0+11509)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 19
  
  DW_TAG_array_type         <11516 (CU 0@0+11516)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <11525 (CU 0@0+11525)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat1) 79
  
  DW_TAG_array_type         <11532 (CU 0@0+11532)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <11541 (CU 0@0+11541)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat2) 1279
  
  DW_TAG_pointer_type       <11549 (CU 0@0+11549)>
  DW_AT_type           (49;ref4) <10848 (CU 0@0+10848)>
  DW_AT_byte_size      (0B;dat1) 0x00000004
  DW_AT_decl_file      (3A;dat1) 0x00000001 /Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c
  DW_AT_decl_line      (3B;dat1) 0
  
  DW_TAG_array_type         <11557 (CU 0@0+11557)>
  DW_AT_type           (49;ref4) <7988 (CU 0@0+7988)>
    
    DW_TAG_subrange_type      <11562 (CU 0@0+11562)>
    DW_AT_type           (49;ref4) <7847 (CU 0@0+7847)>
    DW_AT_upper_bound    (2F;dat2) 511
  

** lines information
  
Line info entry #   0:   ea: 1C60, fileno: 2, lineno: 21 (/Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h:21)  
Line info entry #   1:   ea: 1C72, fileno: 2, lineno: 23 (/Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h:23)  
Line info entry #   2:   ea: 1C89, fileno: 2, lineno: 24 (/Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h:24)  
Line info entry #   3:   ea: 1C90, fileno: 2, lineno: 25 (/Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h:25)  
Line info entry #   4:   ea: 1CA0, fileno: 2, lineno: 24 (/Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h:24)  
Line info entry #   5:   ea: 1CA6, fileno: 2, lineno: 26 (/Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h:26)  
Line info entry #   6:   ea: 1CB2, fileno: 2, lineno: 27 (/Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h:27)  
Line info entry #   7:   ea: 1CBA, fileno: 2, lineno: 27 (/Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/sha1-sse2.h:27)  
Line info entry #   8:   ea: 1CC0, fileno: 1, lineno: 3048 (/Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c:3048)  
Line info entry #   9:   ea: 1CC6, fileno: 1, lineno: 3049 (/Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c:3049)  
Line info entry #  10:   ea: 1CD5, fileno: 1, lineno: 3052 (/Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c:3052)  
Line info entry #  11:   ea: 1CE6, fileno: 1, lineno: 3050 (/Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c:3050)  
Line info entry #  12:   ea: 1CE8, fileno: 1, lineno: 3050 (/Users/arnaud/idasrc/tmp/aircrack-ng-1.1-patched/aircrack-ng-1.1/src/aircrack-ng.c:3050)  
